In [38]:
import pandas as pd

### DataFrame

In [39]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

### Series

In [40]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [41]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

### Indexing in Pandas

In [42]:
products = pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])
products

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

In [43]:
products.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, Product A to Product B
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Bob     2 non-null      object
 1   Sue     2 non-null      object
dtypes: object(2)
memory usage: 48.0+ bytes

In [44]:
# Index-based selection
products.iloc[1]

Bob    It was awful.
Sue           Bland.
Name: Product B, dtype: object

In [45]:
# Index-based selection
products.iloc[:, 1]

Product A    Pretty good.
Product B          Bland.
Name: Sue, dtype: object

In [46]:
# Index-based selection
products.iloc[:, :]

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

In [47]:
# Label-based selection
products.loc['Product B', 'Sue']

'Bland.'

In [48]:
# Label-based selection
products.loc['Product A', ['Bob', 'Sue']]

Bob     I liked it.
Sue    Pretty good.
Name: Product A, dtype: object

### Renaming Columns

In [49]:
products.rename(columns={'Sue': 'Chalton'})

                     Bob       Chalton
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

### Renaming Indexes

In [50]:
products.rename(index={'Product B': 'Product A + B'})

                         Bob           Sue
Product A        I liked it.  Pretty good.
Product A + B  It was awful.        Bland.

### Renaming Axis

In [51]:
products.rename_axis("products", axis='rows').rename_axis("names", axis='columns')

names                Bob           Sue
products
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

## Merging DataSets using Python

### Technique 1: Concatenation

 ##### Merging datasets along an axis (either rows or columns)

In [52]:
# Sample dataset 1: Sales data for different months
monthly_sales_df = pd.DataFrame({'Month': ['Jan', 'Feb', 'Mar'],
         'Sales': [1000, 1200, 800]})
monthly_sales_df

  Month  Sales
0   Jan   1000
1   Feb   1200
2   Mar    800

In [53]:
# Sample dataset 2: Sales data for different products
product_sales_df = pd.DataFrame({'Product': ['A', 'B', 'C'],
         'Sales': [500, 600, 400]})
product_sales_df

  Product  Sales
0       A    500
1       B    600
2       C    400

##### Horizontal Concatenation

In [54]:
pd.concat([monthly_sales_df, product_sales_df], axis=0)

  Month  Sales Product
0   Jan   1000     NaN
1   Feb   1200     NaN
2   Mar    800     NaN
0   NaN    500       A
1   NaN    600       B
2   NaN    400       C

##### Vertical Concatenation

In [55]:
pd.concat([monthly_sales_df, product_sales_df], axis=1)

  Month  Sales Product  Sales
0   Jan   1000       A    500
1   Feb   1200       B    600
2   Mar    800       C    400

### Technique 2: Merging

##### Merging dataset based on common columns. Similar to performing SQL JOIN operations

In [56]:
# Sample dataset 1: Customer information
customers_df = pd.DataFrame({'CustomerID': [1001, 1002, 1003], 'Name': ['Alice',  'Bob', 'Charlie']})
customers_df

   CustomerID     Name
0        1001    Alice
1        1002      Bob
2        1003  Charlie

In [57]:
# Sample dataset 2: Purchase history
purchase_df = pd.DataFrame({'CustomerID': [1002, 1003, 1004], 'Product': ['A',  'B', 'C']})
purchase_df

   CustomerID Product
0        1002       A
1        1003       B
2        1004       C

##### Inner Join

In [58]:
pd.merge(customers_df, purchase_df, on='CustomerID', how='inner')

   CustomerID     Name Product
0        1002      Bob       A
1        1003  Charlie       B

##### Left Join

In [59]:
pd.merge(customers_df, purchase_df, on='CustomerID', how='left')

   CustomerID     Name Product
0        1001    Alice     NaN
1        1002      Bob       A
2        1003  Charlie       B

##### Right Join

In [60]:
pd.merge(customers_df, purchase_df, on='CustomerID', how='right')

   CustomerID     Name Product
0        1002      Bob       A
1        1003  Charlie       B
2        1004      NaN       C

##### Outer Join

In [61]:
pd.merge(customers_df, purchase_df, on='CustomerID', how='outer')

   CustomerID     Name Product
0        1001    Alice     NaN
1        1002      Bob       A
2        1003  Charlie       B
3        1004      NaN       C

##### If no common column name then the `left_on` and `right_on` arguments are used in `pd.merge(df1, df2, how='inner', left_on='id', right_on='product_id')` (instead of just `on`) to make the link between the two tables.

### Technique 3: Joining

##### Aligning datasets by their common indexes

In [62]:
# Sample dataset 1: Student names and scores
students_score_df =  pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie'],
         'Score': [85, 92, 78]}, index=['a', 'b', 'c'])
students_score_df

      Name  Score
a    Alice     85
b      Bob     92
c  Charlie     78

In [63]:
# Sample dataset 2: Student grades
grade_pass_df =  pd.DataFrame({'Grade': ['A+', 'B+', 'D+'],
         'Status': ['Pass', 'Pass', 'Fail']}, index=['a', 'b', 'd'])
grade_pass_df

  Grade Status
a    A+   Pass
b    B+   Pass
d    D+   Fail

##### Inner Join

In [64]:
students_score_df.join(grade_pass_df, how='inner')

    Name  Score Grade Status
a  Alice     85    A+   Pass
b    Bob     92    B+   Pass

##### Left Join

In [65]:
students_score_df.join(grade_pass_df, how='left')

      Name  Score Grade Status
a    Alice     85    A+   Pass
b      Bob     92    B+   Pass
c  Charlie     78   NaN    NaN

##### Right Join

In [66]:
students_score_df.join(grade_pass_df, how='right')

    Name  Score Grade Status
a  Alice   85.0    A+   Pass
b    Bob   92.0    B+   Pass
d    NaN    NaN    D+   Fail

##### Outer Join

In [67]:
students_score_df.join(grade_pass_df, how='outer')

      Name  Score Grade Status
a    Alice   85.0    A+   Pass
b      Bob   92.0    B+   Pass
c  Charlie   78.0   NaN    NaN
d      NaN    NaN    D+   Fail